Revit 2027 API
Zone.Boundary Property
Returns the boundary of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArray Boundary { get; }
Public ReadOnly Property Boundary As CurveArray
	Get
public:
property CurveArray^ Boundary {
	CurveArray^ get ();
}
member Boundary : CurveArray with get
Property Value
CurveArray
Remarks
This property is used to retrieve the segments that constitute the boundary of the Zone. Each Zone may have several regions, each of which have several segments hence the data is returned in the form of an array of boundary segment arrays. See the Zone.BoundarySegment object for more details about the segments that make up the Zone topology.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace